read_verilog -sv -formal -overwrite {workspace}/core/vsrc/ALU.v
design -reset-vlog; proc;
write_json {workspace}/netlist/ALU.json